using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace task_15
{
    // Задание: Хеширование.Города.
    // Дан массив названий населенных пунктов (всего 143 элемента):
    // string[] arrTowns = {...};
    // Необходимо разработать функцию, которая бы по входному строковому массиву формировала хеш-таблицу(256 ячеек) по принципу закрытого хеширования, так как у нас количество входных данных гарантировано меньше 256 ячеек.
    // При возникновении коллизий использовать смещение равное 7.
    // Запустить программу и определить количество коллизий при обработке данного массива.
    // В качестве ответа указать количество коллизий (число) и значение элемента с индексом 5.
    // При вызове преобразовывать входные строки к верхнему регистру.

    class Program
    {
        public static int GetHash(string strS)
        {
            var res = 0;

            foreach (var c in strS)
                res += c;

            res %= 256;
            return res;
        }

        static void Main(string[] args)
        {
            Console.OutputEncoding = Encoding.UTF8;

            string[] arrTowns = 
            {
                "Антипово", "Батецкий", "Батецко", "Бахарево", "Белая", "Большие Ясковицы", "Большое Войново", "Большой Волок", "Большой Латовец", "Большой Теребец", "Большой Удрай", "Бор", "Борки", "БОРОК", "Брод", "Будыни", "Велеши", 
                "Витцы", "Вольная Горка", "Воронино", "Вороново", "Вяжищи", "Гастухово", "Глухово", "Глухой Бережок", "Голешино", "Головская", "ГОРОДНЯ", "Григорево", "Дедино", "ДОРОГОБУЖ", "Дорогони", "Дрегла", "Дубровка", "Жабино", "Жегжичино", 
                "Жестяная Горка", "Жили", "Жилой Бережок", "Заосье", "Заполье", "Заречная", "Заупора", "Змеева Гора", "Ивня", "Илемцы", "Клобучи", "Корокса", "Косицкое", "Кострони", "Кочино", "Кошельково", "Красовицы", "Кромы", "Крючково", "Курино", 
                "Кчера", "Кшева", "Лапушицы", "Лежно", "Лихарева Горка", "Лужки", "Любенец", "Любеховичи", "Любино Поле", "Люболяды", "Малое Войново", "Малые Торошковичи", "Малые Ясковицы", "Малый Латовец", "Малый Теребец", "Малый Удрай", "Марьино", 
                "Мелковичи", "МОЙКА", "Мроткино", "Мячино", "Нежатицы", "Некрасово", "Несуж", "Нехино", "Нива", "Новоселок", "Новые Гусины", "Обколи", "Овсино", "Огурково", "Ожогин Волочек", "Озерово", "Остров", "Островище", "Оттурицы", "Очно", 
                "Передки", "Передольская", "Погост-Сабле", "Подберезье", "Подборовье", "Подгорье", "ПОКРОВКА", "ПРЕОБРАЖЕНКА", "Пустошка", "Раглицы", "Радгостицы", "Раджа", "Радовеж", "Радоли", "Редбуж", "Речка", "Русыня", "Светлая", "Селище", 
                "Село Михайловское", "Сельцо", "Середогощь", "Скачели", "Смыч", "Старое Голубково", "Старые Гусины", "Столбец", "Страшево", "Танина Гора", "Теребеник", "Теребони", "Терехани", "Толчино", "Торошино", "Торчиново", "Уномерь", "Уношковичи", 
                "Хвостец", "Холохно", "Хотобужи", "Хочени", "Хочуни", "Хрепле", "Хрипцы", "Черная", "Черновицы", "Черное", "Щепино", "Щепы", "Яковлева Горка" 
            };

            const int len = 256;
            const int delta = 7;

            var arrHash = new string[len];

            var n = 0;
           
            foreach(var item in arrTowns)
            {
                var j = GetHash(item.ToUpper());

                while (arrHash[j] != null)
                {
                    ++n;
                    j = (j + delta) % len;
                }

                arrHash[j] = item;
            }

            Console.WriteLine($"n = {n}"); // 97
            Console.WriteLine($"arrHash[5] = {arrHash[5]}"); // Черная

            Console.ReadKey();
        }
    }
}
